In [12]:
import pandas as pd
import numpy as np

## Exercise 1: 
A Series (one-dimensional array) from the Pandas library can be created using the constructor:


    pd.Series (data, index, dtype, copy)

Then, we can create Series objects from arrays, dictionaries, scalars and iterables. Based on this information, answer the following questions.


a) From the list below create an object of type Series.


    data = ['a', 'b', 'c', 'd']


Expected result:


    0    a
    1    b
    2    c
    3    d
    dtype: object


b) From the previous list, obtain:


    10    a
    11    b
    12    c
    13    d
    dtype: object


Tip: Change the index argument.


c) Obtain the Series below:


    0    10
    1    10
    2    10
    3    10
    dtype: int64


d) From the array,


    import numpy as np
    array = np.arange(10,20,2)


Obtain the Series below:


    1    10.0
    2    12.0
    3    14.0
    4    16.0
    5    18.0
    dtype: float64

In [10]:
data =['A','B','C','D']
ex1A = pd.Series(data)
ex1A

0    A
1    B
2    C
3    D
dtype: object

In [11]:
index = [10,11,12,13]
ex1B = pd.Series(data,index)
ex1B

10    A
11    B
12    C
13    D
dtype: object

In [18]:
data_10 = np.ones(4,int)*10
ex1C = pd.Series(data_10)
ex1C

0    10
1    10
2    10
3    10
dtype: int32

In [21]:
data = np.arange(10,19,2)
index = np.arange(1,6)
ex1D = pd.Series(data,index)
ex1D

1    10
2    12
3    14
4    16
5    18
dtype: int32

---
## Exercise 2:
A Series (one-dimensional array) from the Pandas library can be created using the constructor:


    pd.Series (data, index, dtype, copy)


Then, we can create Series objects from arrays, dictionaries, scalars and iterables. Based on this information, answer the following questions.


a) From the list below create an object of type Series.

    data = ['k','w','z','y']


Expected result:


    0    k
    1    w
    2    z
    3    y
    dtype: object


b) From the dictionary below create an object of type Series.


    dic = {'a':10,'b':30,'c':15,'d':12}


Expected result:


    a    10
    b    30
    c    15
    d    12
    dtype: int64


c) Convert to a list the Series objects created previously.


Tip: use the pandas to_list() method.


d) Convert Series objects created in letters a) and b) to DataFrame. Enter a name for the columns. Use the pd.DataFrame() constructor.


Expected Results:


    	Letters
    0	k
    1	w
    2	z
    3	y


        Values
    a	10
    b	30
    c	15
    d	12

In [22]:
ex2A = ['k','w','z','y']
pd.Series(ex2A)

0    k
1    w
2    z
3    y
dtype: object

In [23]:
ex2B = {'a':10,'b':30,'c':15,'d':12}
pd.Series(ex2B)

a    10
b    30
c    15
d    12
dtype: int64

In [25]:
ex2C = pd.Series(ex2B).to_list()
ex2C

[10, 30, 15, 12]

In [34]:
pd.DataFrame((ex2A), columns=['Letters'])

  Letters
0       k
1       w
2       z
3       y

In [36]:
pd.DataFrame((ex2C), columns=['Numbers'])

   Numbers
0       10
1       30
2       15
3       12

---
## Exercise 3: 
Use the NumPy library to create the following Series object.


    25     1.0
    26     3.0
    27     5.0
    28     7.0
    29     9.0
    30    11.0
    31    13.0
    32    15.0
    33    17.0
    34    19.0
    35    21.0
    36    23.0
    37    25.0
    38    27.0
    39    29.0
    40    31.0
    41    33.0
    42    35.0
    43    37.0
    44    39.0
    45    41.0
    46    43.0
    47    45.0
    48    47.0
    49    49.0
    Name: Serie, dtype: float64

In [41]:
pd.Series(data = np.arange(1,50,2),index = np.arange(25,50), dtype= float)

25     1.0
26     3.0
27     5.0
28     7.0
29     9.0
30    11.0
31    13.0
32    15.0
33    17.0
34    19.0
35    21.0
36    23.0
37    25.0
38    27.0
39    29.0
40    31.0
41    33.0
42    35.0
43    37.0
44    39.0
45    41.0
46    43.0
47    45.0
48    47.0
49    49.0
dtype: float64

---
## Exercise 4:
a) From the list below, create an object of type Series with pandas.


    data = ['ITUB4', 'BBDC4', 'BBAS3', 'BPAC11', 'SANB11']


Expected result:

    1     ITUB4
    2     BBDC4
    3     BBAS3
    4    BPAC11
    5    SANB11
    Name: Prices, dtype: object


b) Convert the Series to a dictionary.

c) Convert the Series to a list.

d) Convert the Series to a numpy.ndarray object.

In [44]:
data = ['ITUB4', 'BBDC4', 'BBAS3', 'BPAC11', 'SANB11']
ex4A = pd.Series(data)
ex4A

0     ITUB4
1     BBDC4
2     BBAS3
3    BPAC11
4    SANB11
dtype: object

In [47]:
ex4B = ex4A.to_dict()
ex4B

{0: 'ITUB4', 1: 'BBDC4', 2: 'BBAS3', 3: 'BPAC11', 4: 'SANB11'}

In [48]:
ex4C = ex4A.to_list()
ex4C

['ITUB4', 'BBDC4', 'BBAS3', 'BPAC11', 'SANB11']

In [50]:
ex4D = ex4A.to_numpy()
ex4D

array(['ITUB4', 'BBDC4', 'BBAS3', 'BPAC11', 'SANB11'], dtype=object)

---
## Exercise 5:
a) From the dictionary below, create an object of type Series and store it in a variable. Then, convert the created object to a list. Finally, create a DataFrame with the available data.


    data = {
        'ABEV3':12.85,
        'AZUL4':22.55,
        'BTOW3':115.08,
        'RENT3':49.03,
        'JBSS3':24.41,
        }


b) Add the new values to the created Series:


    RAIL3: 18.93
    SUZB3: 48.19
    MGLU3: 25.59

In [58]:
data = {
    'ABEV3':12.85,
    'AZUL4':22.55,
    'BTOW3':115.08,
    'RENT3':49.03,
    'JBSS3':24.41,
    }
ex5A_0 = pd.Series(data)
ex5A_0

ABEV3     12.85
AZUL4     22.55
BTOW3    115.08
RENT3     49.03
JBSS3     24.41
dtype: float64

In [59]:
ex5A_1 = ex5A_0.to_list()
ex5A_1

[12.85, 22.55, 115.08, 49.03, 24.41]

In [60]:
ex5A_2 = pd.DataFrame(ex5A_1, columns=['Prices'])
ex5A_2

   Prices
0   12.85
1   22.55
2  115.08
3   49.03
4   24.41

In [61]:
ex5A_0['RAIL3'] =  18.93
ex5A_0['SUZB3'] =  48.19
ex5A_0['MGLU3'] =  25.59
ex5A_0

ABEV3     12.85
AZUL4     22.55
BTOW3    115.08
RENT3     49.03
JBSS3     24.41
RAIL3     18.93
SUZB3     48.19
MGLU3     25.59
dtype: float64

---
## Exercise 6:
Add the three new values to the Series below.


    PETR4:22,97;
    NTCO3:50,60;
    TIMP3:14,82.


    data = {
        'ABEV3':12.85,
        'AZUL4':22.55,
        'BTOW3':115.08,
        'RENT3':49.03,
        'JBSS3':24.41,
        } 
     
    serie = pd.Series(data)


Expected result:


    ABEV3     12.85
    AZUL4     22.55
    BTOW3    115.08
    RENT3     49.03
    JBSS3     24.41
    PETR4     22.97
    NTCO3     50.60
    TIMP3     14.82
    dtype: float64

In [65]:
data = {
    'ABEV3':12.85,
    'AZUL4':22.55,
    'BTOW3':115.08,
    'RENT3':49.03,
    'JBSS3':24.41,
    } 

ex6A = pd.Series(data)
ex6A

ABEV3     12.85
AZUL4     22.55
BTOW3    115.08
RENT3     49.03
JBSS3     24.41
dtype: float64

In [66]:
ex6A['PETR4'] = 22.97
ex6A['NTCO3'] = 50.60
ex6A['TIMP3'] = 14.82
ex6A

ABEV3     12.85
AZUL4     22.55
BTOW3    115.08
RENT3     49.03
JBSS3     24.41
PETR4     22.97
NTCO3     50.60
TIMP3     14.82
dtype: float64

---
## Exercise 7: 
Create Series A and B below :

A:

    A     1
    B     3
    C     5
    D     7
    E     9
    F    11
    G    13
    H    15
    I    17
    J    19
    dtype: int64

B:

    F     5
    G    10
    H    15
    I    20
    J    25
    K    30
    L    35
    M    40
    N    45
    dtype: int64

In [70]:
pd.Series(data = np.arange(1,20,2), index= list('ABCDEFGHIJ'))

A     1
B     3
C     5
D     7
E     9
F    11
G    13
H    15
I    17
J    19
dtype: int32

In [71]:
pd.Series(data = np.arange(5,46,5), index= list('FGHIJKLMN'))

F     5
G    10
H    15
I    20
J    25
K    30
L    35
M    40
N    45
dtype: int32